docs/Math/Statistics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-05-14 Sun 20:48 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="weiwu" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline3">1. Statistical Learning</a>
<ul>
<li><a href="#orgheadline1">1.1. what is statistical learning</a></li>
<li><a href="#orgheadline2">1.2. assessing model accuracy</a></li>
</ul>
</li>
<li><a href="#orgheadline6">2. Linear Regression</a>
<ul>
<li><a href="#orgheadline4">2.1. Simple Linear Regression</a></li>
<li><a href="#orgheadline5">2.2. Multiple Linear Regression</a></li>
</ul>
</li>
<li><a href="#orgheadline10">3. Classification</a>
<ul>
<li><a href="#orgheadline7">3.1. Logistic Regression</a></li>
<li><a href="#orgheadline8">3.2. Linear Discriminant Analysis</a></li>
<li><a href="#orgheadline9">3.3. Comparison</a></li>
</ul>
</li>
<li><a href="#orgheadline13">4. Resampling Methods</a>
<ul>
<li><a href="#orgheadline11">4.1. Cross-Validation</a></li>
<li><a href="#orgheadline12">4.2. The Bootstrap</a></li>
</ul>
</li>
<li><a href="#orgheadline16">5. Tree-Based Methods</a>
<ul>
<li><a href="#orgheadline14">5.1. Decision Trees</a></li>
<li><a href="#orgheadline15">5.2. Bagging, Random Forests, Boosting</a></li>
</ul>
</li>
<li><a href="#orgheadline20">6. Support Vector Machine</a>
<ul>
<li><a href="#orgheadline17">6.1. Maximal Margin Classifier</a></li>
<li><a href="#orgheadline18">6.2. Support Vector Classifiers</a></li>
<li><a href="#orgheadline19">6.3. Support Vector Machines</a></li>
</ul>
</li>
<li><a href="#orgheadline25">7. Unsupervised Learning</a>
<ul>
<li><a href="#orgheadline21">7.1. Principal Components Analysis</a></li>
<li><a href="#orgheadline24">7.2. Clustering Methods</a>
<ul>
<li><a href="#orgheadline22">7.2.1. K-Means Clustering</a></li>
<li><a href="#orgheadline23">7.2.2. Hierarchical Clustering</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">1</span> Statistical Learning</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> what is statistical learning</h3>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> assessing model accuracy</h3>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">2</span> Linear Regression</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">2.1</span> Simple Linear Regression</h3>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">2.2</span> Multiple Linear Regression</h3>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">3</span> Classification</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">3.1</span> Logistic Regression</h3>
</div>

<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">3.2</span> Linear Discriminant Analysis</h3>
</div>

<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">3.3</span> Comparison</h3>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13"><span class="section-number-2">4</span> Resampling Methods</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">4.1</span> Cross-Validation</h3>
</div>

<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">4.2</span> The Bootstrap</h3>
</div>
</div>

<div id="outline-container-orgheadline16" class="outline-2">
<h2 id="orgheadline16"><span class="section-number-2">5</span> Tree-Based Methods</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">5.1</span> Decision Trees</h3>
</div>

<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">5.2</span> Bagging, Random Forests, Boosting</h3>
</div>
</div>

<div id="outline-container-orgheadline20" class="outline-2">
<h2 id="orgheadline20"><span class="section-number-2">6</span> Support Vector Machine</h2>
<div class="outline-text-2" id="text-6">
<p>
Support vector machines (SVMs) are a set of related supervised learning methods used for classification and regression. Given a set of training examples, each marked as belonging to one of two categories, an SVM training algorithm builds a model that predicts whether a new example falls into one category or the other.
</p>
</div>

<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17"><span class="section-number-3">6.1</span> Maximal Margin Classifier</h3>
</div>

<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18"><span class="section-number-3">6.2</span> Support Vector Classifiers</h3>
</div>

<div id="outline-container-orgheadline19" class="outline-3">
<h3 id="orgheadline19"><span class="section-number-3">6.3</span> Support Vector Machines</h3>
</div>
</div>

<div id="outline-container-orgheadline25" class="outline-2">
<h2 id="orgheadline25"><span class="section-number-2">7</span> Unsupervised Learning</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-orgheadline21" class="outline-3">
<h3 id="orgheadline21"><span class="section-number-3">7.1</span> Principal Components Analysis</h3>
</div>

<div id="outline-container-orgheadline24" class="outline-3">
<h3 id="orgheadline24"><span class="section-number-3">7.2</span> Clustering Methods</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Cluster analysis is the assignment of a set of observations into subsets (called clusters) so that observations within the same cluster are similar according to some predesignated criterion or criteria, while observations drawn from different clusters are dissimilar. Different clustering techniques make different assumptions on the structure of the data, often defined by some similarity metric and evaluated for example by internal compactness (similarity between members of the same cluster) and separation between different clusters. Other methods are based on estimated density and graph connectivity. Clustering is a method of unsupervised learning, and a common technique for statistical data analysis.
</p>
</div>

<div id="outline-container-orgheadline22" class="outline-4">
<h4 id="orgheadline22"><span class="section-number-4">7.2.1</span> K-Means Clustering</h4>
</div>

<div id="outline-container-orgheadline23" class="outline-4">
<h4 id="orgheadline23"><span class="section-number-4">7.2.2</span> Hierarchical Clustering</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-05-10 Wed&gt;</span></span></p>
<p class="author">Author: weiwu</p>
<p class="date">Created: 2017-05-14 Sun 20:48</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
